app/views/shared/_user_info.html.erb

SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 1]]
---
      <span>
        <%= pluralize(current_user.microposts.count,"micropost") %>