app/controllers/account_activations_controller.rb

  def edit
     user = User.find_by(email: params[:email])
     if user && !user.activated? && user.authenticated?(:activation, params[:id])
       user.activate
       user.update_attribute(:activated,    true)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "rahul@gmail.com"]]
UPDATE "users" SET "activated_at" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["activated_at", "2016-01-07 04:47:21.653307"], ["updated_at", "2016-01-07 04:47:21.653836"], ["id", 70]]