app/controllers/microposts_controller.rb

  def create
    @micropost=current_user.microposts.build(micropost_params)
    if @micropost.save
---
INSERT INTO "microposts" ("content", "picture", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "image test upload post"], ["picture", "rails.png"], ["user_id", 1], ["created_at", "2016-01-08 06:16:14.115679"], ["updated_at", "2016-01-08 06:16:14.115679"]]