app/controllers/password_resets_controller.rb

 def create
    #  render json:params[:password_reset][:email]
    @user=User.find_by(email: params[:password_reset][:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "test@gmail.com"]]

  def update
    # render plain:"Test template"
    #render json:@user
     if params[:user][:password].empty?
       @user.errors.add(:password,"Password Can't be Empty")
       render 'edit'
     elsif @user.update_attributes(user_params)
---
SELECT  "users".* FROM "users" WHERE "email"."uzaif@gmail.com" = '' LIMIT 1
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$WIYxNlFYsktRf1JWgKrv9Ouavmd.7WVeHyBUzjKbadHe0Vumd.h0G"], ["updated_at", "2016-01-07 07:19:13.878045"], ["id", 1]]