app/controllers/sessions_controller.rb

  def create

    #render json:params[:sessions][:email]+" "+params[:sessions][:password
    #render json:
    #render "new"
    #render  json:user.to_yaml

    user = User.find_by(email:params[:sessions][:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "uzaif@gmail.com"]]