app/controllers/static_pages_controller.rb

  def home
    if logged_in?
      @micropost=current_user.microposts.build
      @feed_items = current_user.feed.paginate(page: params[:page],per_page:5).order('created_at DESC')
---
SELECT  "microposts".* FROM "microposts" WHERE (user_id = 1)  ORDER BY created_at DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 1]]