app/controllers/users_controller.rb

  def index
    if current_user.admin?
      @users = User.paginate(:page=>params[:page],per_page:5)
    else
      @users = User.where(:activated=>true).paginate(:page=>params[:page],per_page:5)
---
SELECT "users".* FROM "users"
SELECT COUNT(*) FROM "users"
SELECT  "users".* FROM "users" WHERE "users"."activated" = ? LIMIT 5 OFFSET 0  [["activated", "t"]]
SELECT COUNT(*) FROM "users" WHERE "users"."activated" = ?  [["activated", "t"]]

  def show
   @user=User.find_by(id: params[:id])
   @microposts=@user.microposts.paginate(:page=>params[:page],per_page:10)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "microposts".* FROM "microposts" WHERE "microposts"."user_id" = ? LIMIT 10 OFFSET 0  [["user_id", 1]]
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 1]]

  def edit
    @user=User.find_by(:id=>params[:id]);
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]

  def destroy

    user=User.find_by(id:params[:id])
    name=user.name
    if !user.admin? && user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 37]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 37]]